УТ/src/Catalogs/CRM_ДействияТриггеров/CRM_ДействияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияТриггеров</name>
  <predefined>
    <items>
      <name>ГенерацияИнтересаПоИнтересу</name>
      <description>Генерация интереса по интересу</description>
    </items>
    <items>
      <name>СоздатьВзаимодействие</name>
      <description>Запланировать взаимодействие</description>
    </items>
    <items>
      <name>ПересчетПотенциалаВИнтересе</name>
      <description>Заполнить  поле &quot;Ожидаемая  выручка&quot; </description>
    </items>
    <items>
      <name>ОтказЗаписи</name>
      <description>Запретить запись</description>
    </items>
    <items>
      <name>ЗапретитьЗаписьПриНаличииДокументов</name>
      <description>Запретить запись при наличии документов</description>
    </items>
    <items>
      <name>ЗапретитьЗаписьПриОтсутствииБП</name>
      <description>Запретить запись при отсутствии бизнес-процесса</description>
    </items>
    <items>
      <name>ЗапретитьЗаписьПриОтсутствииДокументов</name>
      <description>Запретить запись при отсутствии документов</description>
    </items>
    <items>
      <name>ЗапретитьРедактированиеДокументаКоммерческоеПредложение</name>
      <description>Запретить редактирование документа Коммерческое предложение</description>
    </items>
    <items>
      <name>СтартПроизвольногоБП</name>
      <description>Запустить бизнес-процесс</description>
    </items>
    <items>
      <name>ЗапуститьБППоРасписанию</name>
      <description>Запустить бизнес-процесс (по расписанию)</description>
    </items>
    <items>
      <name>ИзменитьОтветственногоВИнтересе</name>
      <description>Изменить ответственного в интересе</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтереса</name>
      <description>Изменить состояние интереса</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтересаПослеNДнейБезОтвета</name>
      <description>Изменить состояние интереса после N дней без ответа</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтересаЧерезNДнейНаЭтапе</name>
      <description>Изменить состояние интереса после N дней на этапе</description>
    </items>
    <items>
      <name>ИзменитьТемуИнтереса</name>
      <description>Изменить тему интереса</description>
    </items>
    <items>
      <name>ИзменитьЭтапБизнесПроцессаОбъекта</name>
      <description>Изменить этап бизнес-процесса объекта</description>
    </items>
    <items>
      <name>ОтказСозданияВФорме</name>
      <description>Отказ создания в форме</description>
    </items>
    <items>
      <name>ОтложенныйЗапускИнтересаПослеЗавершенияИнтереса</name>
      <description>Отложенно запустить интерес после завершения интереса</description>
    </items>
    <items>
      <name>ОповещениеПочта</name>
      <description>Отправить E-mail</description>
    </items>
    <items>
      <name>ОповещениеСМС</name>
      <description>Отправить SMS</description>
    </items>
    <items>
      <name>ОповещениеМессенджер</name>
      <description>Отправить сообщение в мессенджер</description>
    </items>
    <items>
      <name>ПереадресацияЭлектронныхПисем</name>
      <description>Переадресация электронных писем</description>
    </items>
    <items>
      <name>РассылкаПоСегменту</name>
      <description>Рассылка электронных писем  клиентам в сегменте</description>
    </items>
    <items>
      <name>СозданиеЗаявкиНаОснованииПисьма</name>
      <description>Создание заявки(лида) на основании письма</description>
    </items>
    <items>
      <name>ЗаявкаССайта</name>
      <description>Создание интереса клиента (лида) на основание письма-заявки</description>
    </items>
    <items>
      <name>СоздатьЗадачуПоОбъекту</name>
      <description>Создать задачу</description>
    </items>
    <items>
      <name>СоздатьЗадачуПоРасписанию</name>
      <description>Создать задачу (по расписанию)</description>
    </items>
    <items>
      <name>ОповещениеНапоминание</name>
      <description>Создать напоминание</description>
    </items>
    <items>
      <name>CRM_Модуль_ПривязкаЗаказовКИнтересам</name>
      <description>Привязка заказов к интересам</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТипов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ДействияТриггеров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если РежимОтладки Тогда
		Если НЕ Пользователи.ТекущийПользователь().Служебный Тогда
			Обработка = CRM_ТриггерыСервер.ВернутьОбработкуДействия(Новый Структура("Действие", ЭтотОбъект));
		КонецЕсли;
	Иначе	
		ОбработкаПроверки = ОбработкаДействия.Получить();
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
		Если ОбработкаПроверки = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана обработка действия! Запись невозможна!';
				|en='Action processor is not selected! Processing impossible!'"));
			Отказ = Истина;
			Возврат;
		Иначе
			ОбработкаПроверки.Записать(ИмяВременногоФайла);
		КонецЕсли;
		
		ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий" + "");
		ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;                                            
		
		Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
		
		Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища, , Ложь, ПараметрыЗащиты), Ложь);
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка выполнения'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	ОбъектыДействия = "";
	Если Обработка <> Неопределено И Обработка.Метаданные().Реквизиты.Найти("ОбъектДействия") <> Неопределено Тогда
		ОписаниеТипаОбъектаДействия = Обработка.Метаданные().Реквизиты.ОбъектДействия.Тип;
		ОписаниеТипов = Новый ХранилищеЗначения(ОписаниеТипаОбъектаДействия);
		
		МассивОбъектов = Новый Массив;
		Для каждого Тип Из ОписаниеТипаОбъектаДействия.Типы() Цикл
			ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
			Если МассивОбъектов.Найти(ИдентификаторМетаданных) = Неопределено Тогда
				МассивОбъектов.Добавить(ИдентификаторМетаданных);
			КонецЕсли;
		КонецЦикла;
		Если МассивОбъектов.Количество() > 0 Тогда
			Для каждого Объект Из МассивОбъектов Цикл
				ОбъектыДействия = ОбъектыДействия + ?(ОбъектыДействия = "", "", "; ") + Объект.Синоним;
			КонецЦикла;
		Иначе
			ОбъектыДействия = НСтр("ru='Произвольный';en='The arbitrary'");
		КонецЕсли;
	Иначе
		ОписаниеТипов = Новый ХранилищеЗначения(Неопределено);
		ОбъектыДействия = НСтр("ru='Не определен';en='Not Stated'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
